# Week 1 - Review
Welcome to your review for Week 1 of Introduction SQL. This Jupyter Notebook will present you with a series of problems you need to solve.
To begin, make sure you have selected the SQL kernel from the dropdown menu above, and attach this notebook to your "dvdrental" database.
Pay close attention to the directions and modify the SQL as needed to get a correct result. Good luck!
* * *

### Problem 1:

The following SQL is invalid. Rewrite the query so it returns each unique first name from the actor table that occurs more than 3 times.

In [ ]:
SELECT first_name
    , COUNT(1)
FROM actor
WHERE COUNT(1) > 3
GROUP BY first_name

___
### Problem 2:

Rewrite the following query using the BETWEEN logical operator to return the same results.

In [ ]:
SELECT DISTINCT first_name
    , last_name
FROM actor
WHERE last_name > 'J'
    AND last_name < 'M'
ORDER BY 2, 1

___
### Problem 3:

Finish the query below by filtering the results to only return actors and actresses whose name begins with W and ends with N

In [ ]:
SELECT first_name
    , last_name
FROM actor
--
ORDER BY 2, 1

* * *

### Problem 4:

Rewrite the following query so it returns all actors and actresses named either Penelope Monroe or Michael Bening.

In [ ]:
SELECT first_name
    , last_name
FROM actor
WHERE (first_name = 'Penelope')
    OR first_name = 'Michael'
    AND last_name = 'Bening'
    AND last_name = 'Monroe'

* * *
### Problem 5
Rewrite the following query to combine last\_name and first\_name into a single column with a comma between them, like "Hopkins, Anthony." Then sort the results in descending order.

In [ ]:
SELECT last_name
    , first_name
FROM actor
ORDER BY 2, 1